In [1]:
import pandas as pd

In [2]:
data = {'Name': ['Alpha','Bravo','Charlie'],'ID':[111,222,333]}

In [4]:
df = pd.DataFrame(data)
df

      Name   ID
0    Alpha  111
1    Bravo  222
2  Charlie  333

Find Alpha

In [10]:
df['Name']=='Alpha'

0     True
1    False
2    False
3     True
Name: Name, dtype: bool

In [7]:
df[df['Name']=='Alpha']

    Name   ID
0  Alpha  111

There are now two Alphas. Find both of them.

In [12]:
data = {'Name': ['Alpha','Bravo','Charlie','Alpha'],'ID':[111,222,333,444]}

In [13]:
df = pd.DataFrame(data)
df

      Name   ID
0    Alpha  111
1    Bravo  222
2  Charlie  333
3    Alpha  444

In [15]:
df[df['Name']=='Alpha']

    Name   ID
0  Alpha  111
3  Alpha  444